# Aggregation & Grouping in Pandas

Grouping and aggregating helps you **summarize your data** â€” like answering:
- â€œWhatâ€™s the **average salary per department**?â€  
- â€œHow many **users joined per month**?â€

Pandas makes this easy with the powerful `.groupby()` method.

---

## ðŸ‘¥ The `.groupby()` Function

`df.groupby()` is used to group rows of a DataFrame based on values in one or more columns,  
allowing you to perform **aggregate functions** like `sum()`, `mean()`, `count()`, etc.

### Example DataFrame

```python
import pandas as pd

df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

print(df)
```

---

### ðŸ§® Group by a Single Column

```python
df.groupby("Department")["Salary"].mean()
```
> â€œGroup by Department, then calculate the **average Salary** for each group.â€

---

### âš™ï¸ Common Aggregation Functions

```python
df.groupby("Team")["Salary"].mean()   # Average per team
df.groupby("Team")["Salary"].sum()    # Total salary per team
df.groupby("Team")["Salary"].count()  # Number of records per team
df.groupby("Team")["Salary"].min()    # Minimum salary per team
df.groupby("Team")["Salary"].max()    # Maximum salary per team
```

---

### ðŸ“Š Group by Multiple Columns

```python
df.groupby(["Team", "Gender"])["Salary"].mean()
```
> Calculates average salary for each **Teamâ€“Gender combination**.

---

## ðŸ§  Custom Aggregations with `.agg()`

You can apply **multiple functions at once** to grouped data.

```python
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])
```

ðŸŸ¢ `.agg()` and `.aggregate()` are **the same function** â€” theyâ€™re just aliases.

---

### ðŸ·ï¸ Name Your Own Aggregation Columns

```python
df.groupby("Team")["Salary"].agg(
    avg_salary="mean",
    high_salary="max"
)
```

---

### ðŸ§© Apply Different Functions to Different Columns

```python
df.groupby("Team").agg({
    "Salary": "mean",
    "Age": "max"
})
```

This gives the **average Salary** and **maximum Age** for each team.

---

## ðŸ” Transform vs Aggregate vs Filter

| Operation | Returns | When to Use | Example |
|------------|----------|--------------|----------|
| `.aggregate()` | Single value per group | Summary statistic (e.g., mean) | `df.groupby("Team")["Salary"].mean()` |
| `.transform()` | Same shape as original | Add new derived columns | `df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")` |
| `.filter()` | Subset of rows | Keep or discard groups | `df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)` |

---

### ðŸ§® `.transform()` Example

Adds a **new column** showing the average salary of each employeeâ€™s team:

```python
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")
print(df[["Team", "Salary", "Team Avg"]])
```

**Output:**
```
  Team  Salary  Team Avg
0    A      85      87.5
1    A      90      87.5
2    B      78      81.5
3    B      85      81.5
4    C      92      90.0
5    C      88      90.0
6    D      75      77.5
7    D      80      77.5
```

---

### ðŸ” `.filter()` Example

Keep only the teams whose **average salary > 80**:

```python
df_filtered = df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)
print(df_filtered)
```

---

## âœ… Summary

| Concept | Function | Description |
|----------|-----------|-------------|
| **Group by one or more columns** | `df.groupby()` | Splits data into groups |
| **Compute statistics** | `.mean()`, `.sum()`, `.count()` | Common aggregate functions |
| **Multiple aggregations** | `.agg()` | Apply multiple or custom metrics |
| **Per-row group values** | `.transform()` | Adds computed group stats to original data |
| **Filter groups** | `.filter()` | Keeps groups that meet conditions |

---

### ðŸ’¡ Key Takeaways

- `.groupby()` is your **go-to tool** for summarizing large datasets.  
- Use `.agg()` for **custom or multiple aggregations**.  
- Use `.transform()` to **add new columns** with group-level info.  
- Use `.filter()` to **select only certain groups** based on conditions.  

---

### ðŸš€ Next Topic: Merging & Joining Data

Often, data is split across multiple tables or files.  
Pandas lets you **combine datasets** just like SQL â€” or even more flexibly!

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})  
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [3]:
#   GRP Dep by their salary   
df.groupby('Department')['Salary'].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [4]:
df.groupby('Department')['Salary'].max()

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

### Agg Function

Agg and aggregate function is same in pandas

In [5]:
df.groupby('Department')['Salary'].agg(['mean', 'min', 'max'])

            mean  min  max
Department
HR          87.5   85   90
IT          81.5   78   85
Marketing   90.0   88   92
Sales       77.5   75   80

In [6]:
df.groupby("Team")["Salary"].agg(                  # For coustom column name  
    avg_score="mean",
    high_score="max"
)

      avg_score  high_score
Team
A          87.5          90
B          81.5          85
C          90.0          92
D          77.5          80

In [7]:
df['Team_Avg'] = df.groupby('Team')['Salary'].transform('mean')               # Use transform when we have to add column 
df

  Department Team Gender  Salary  Age   JoinDate  Team_Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

### P

In [9]:
df.groupby('Department')['Salary'].agg(
    Total_Avg = 'mean',
    Total = 'sum',
    Min_Sal = 'min',
    Max_Sal = 'max')

            Total_Avg  Total  Min_Sal  Max_Sal
Department
HR               87.5    175       85       90
IT               81.5    163       78       85
Marketing        90.0    180       88       92
Sales            77.5    155       75       80

In [10]:
df['Max_Salary'] = df.groupby('Team')['Salary'].transform('max')

In [11]:
df2 = df['Max_Salary'].drop_duplicates(subset='Team')

TypeError: Series.drop_duplicates() got an unexpected keyword argument 'subset'

In [ ]:
df['DAge'] = df.groupby('Team')['Age'].transform('mean')

In [ ]:
df['Age_Diff'] = df['Age'] - df['DAge']

In [ ]:
df

### Prac.

In [13]:
import pandas as pd

df0 = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [14]:
df0

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [29]:
# Q1. Find the average Salary of each Department.

df0.groupby('Department')['Salary'].mean()                # Mean For avg

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [21]:
# Q2. Find the total Salary and total Age for each Team.

df0.groupby("Team")[["Salary", "Age"]].sum()

      Salary  Age
Team
A        175   48
B        163   52
C        180   54
D        155   48

In [23]:
# Q4. Using .agg(), calculate:
# Minimum Salary

df0.groupby('Team')['Salary'].min()

Team
A    85
B    78
C    88
D    75
Name: Salary, dtype: int64

In [30]:
# Q5. Add a new column "Dept Avg" that contains the average Salary of each Department.

df0['Dept Avg'] = df0.groupby('Department')['Salary'].transform('mean')                   # Transform when add new column

In [28]:
df0

  Department Team Gender  Salary  Age   JoinDate  Dept Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

In [34]:
# Q6. Filter only those departments whose average Salary is greater than 85.

df0.groupby('Department')['Salary'].mean().reset_index().query("Salary > 60")         # Query only work on DataFrame so 
                                                                                    # We have to use reset index here

  Department  Salary
0         HR    87.5
1         IT    81.5
2  Marketing    90.0
3      Sales    77.5